package homework_13;
//Написать метод, принимающий на вход массив строк.
// Метод должен вернуть массив, состоящий из самой короткой
// и самой длинной строки изначального массива.
// Создайте массив типа String и заполните его названиями
// знакомых вам городов. Проверьте работу написанного метода на этом массиве.
public class Towns {

    public static void main(String[] args) {
//        String shortest = towns[0];
//        String longest = town[0];
//
//        for (int i = 0; i < towns; i++){
//
//        }



    }
}
