import java.util.Scanner;

public class ScannerTesting {
    // Напишите программу, которая вычисляет сумму
    // всех чисел от 1 до N, гле N вводит пользователь
    public static void main(String[] args) {

        Scanner scanner=new Scanner(System.in);
        System.out.println("Enter the number: ");
        int N= scanner.nextInt();

        int sum=0;
        int zahl=0;


        //while (zahl<=n){


            //%10
            zahl-=zahl;

        }



    }
